МультиПорт/src/Catalogs/MultiPort_НастройкиИсходящихСообщений/MultiPort_НастройкиИсходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>MultiPort_НастройкиИсходящихСообщений</name>
  <attributes>
    <name>СпособФормированияСообщений</name>
    <type>
      <types>EnumRef.MultiPort_СпособыПреобразованияСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаФормированияИсходящего</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПроизвольногоОбработчика</name>
    <type>
      <types>EnumRef.MultiPort_ВариантыПроизвольногоОбработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВстроенногоОбработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФормированияСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбработчикПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбработчикПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОбработчикаПриОтправке</name>
    <type>
      <types>EnumRef.MultiPort_ВариантыПроизвольногоОбработчика</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВстроенногоОбработчикаПриОтправке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаПриОтправке</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьТранспортОбработчика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонструкторСообщения</name>
    <type>
      <types>CatalogRef.MultiPort_КонструкторИсходящихXML</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаКонвертации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеНастройки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтерфейсТранспорта</name>
    <type>
      <types>EnumRef.MultiPort_ИнтерфейсыТранспорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДругиеПараметрыПодключения</name>
    <type>
      <types>CatalogRef.MultiPort_ПодключенияКВнешнимСистемам</types>
    </type>
  </attributes>
  <attributes>
    <name>СжиматьВZip</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступноПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбрабатыватьРезультатЗапроса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипВходящегоДляОбработкиРезультата</name>
    <type>
      <types>CatalogRef.MultiPort_ТипВходящегоСообщения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвращатьОтветВИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПараметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДопЗначениеСоответствия</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МультиПорт/src/Enums/MultiPort_СпособыПреобразованияСообщений/MultiPort_СпособыПреобразованияСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MultiPort_СпособыПреобразованияСообщений</name>
  <enumValues>
    <name>ПроизвольныйАлгоритм</name>
  </enumValues>
  <enumValues>
    <name>КонструкторСообщения</name>
  </enumValues>
  <enumValues>
    <name>ПравилоКонвертации</name>
  </enumValues>
</mdclass:Enum>

МультиПорт/src/Enums/MultiPort_ВариантыПроизвольногоОбработчика/MultiPort_ВариантыПроизвольногоОбработчика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>MultiPort_ВариантыПроизвольногоОбработчика</name>
  <enumValues>
    <name>ПроизвольныйКод</name>
  </enumValues>
  <enumValues>
    <name>ВстроенныйОбработчик</name>
  </enumValues>
  <enumValues>
    <name>ПодключаемыйОбработчик</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяВнеПодсистемы</name>
  </enumValues>
</mdclass:Enum>

МультиПорт/src/Catalogs/MultiPort_НастройкиИсходящихСообщений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	СпособФормированияСообщенийПриИзмененииНаСервере();
	ВариантПроизвольногоОбработчикаПриИзмененииНаСервере();
	ВариантОбработчикаПриОтправкеПриИзмененииНаСервере(); 
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СинхронныйРежимПриИзменении(Элемент)
	
	Если Объект.ИспользоватьОбработчикПослеОтправки Тогда
		ТекстВопроса = "Установлен признак """ + Элементы.ИспользоватьОбработчикПослеОтправки.Заголовок + """
		|он будет снят, т.к. он доступен только при асинхронном режиме. Продолжить?";
		Таймаут = 60;
		ОписаниеОповещения = Новый ОписаниеОповещения("СинхронныйРежимПриИзмененииЗавершение", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, Таймаут);
	Иначе
		СинхронныйРежимПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронныйРежимПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда 
		Объект.СинхронныйРежим = Ложь;
		Возврат;
	КонецЕсли;
	
	СинхронныйРежимПриИзмененииНаСервере();

КонецПроцедуры

&НаСервере
Процедура СинхронныйРежимПриИзмененииНаСервере()
	
	Если Объект.СинхронныйРежим Тогда
		Объект.ИспользоватьОбработчикПослеОтправки = Ложь;
	Иначе
		Объект.ВозвращатьОтветВИнтерфейс = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры 

&НаКлиенте
Процедура ИспользоватьОбработчикПослеОтправкиПриИзменении(Элемент)
	ИспользоватьОбработчикПослеОтправкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИспользоватьОбработчикПослеОтправкиПриИзмененииНаСервере()
	
	Если Объект.ИспользоватьОбработчикПослеОтправки Тогда
		Объект.ОбрабатыватьРезультатЗапроса = Ложь;
	КонецЕсли;
	УстановитьВидимостьДоступность();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбрабатыватьРезультатЗапросаПриИзменении(Элемент)
	ОбрабатыватьРезультатЗапросаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбрабатыватьРезультатЗапросаПриИзмененииНаСервере()
	
	Если Объект.ОбрабатыватьРезультатЗапроса Тогда
		Объект.ИспользоватьОбработчикПослеОтправки = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	ДоступностьПослеОтправки = Не Объект.СинхронныйРежим И Не Объект.ОбрабатыватьРезультатЗапроса;
	Элементы.ГруппаПослеОтправкиДанных.Доступность = ДоступностьПослеОтправки;
	
	ДоступностьОбрабатыватьРезультат = Не Объект.ИспользоватьОбработчикПослеОтправки
										И Не Объект.ВозвращатьОтветВИнтерфейс;
	Элементы.ГруппаОбработкаОтвета.Доступность = ДоступностьОбрабатыватьРезультат;  
	
	Элементы.ВозвращатьОтветВИнтерфейс.Доступность = Объект.СинхронныйРежим;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКодФормированияИзШаблона(Команда)
		
	Объект.КодФормированияСообщения = ПолучитьТекстШаблонаКода();
	
КонецПроцедуры
		
&НаСервере
Функция ПолучитьТекстШаблонаКода()
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекстШаблона = ТекущийОбъект.ПолучитьМакет("ШаблонКодаФормирования");
	
	Возврат ТекстШаблона.ПолучитьТекст();
	
КонецФункции	

&НаКлиенте
Процедура КодФормированияСообщенияПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СпособФормированияСообщенийПриИзменении(Элемент)
	СпособФормированияСообщенийПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СпособФормированияСообщенийПриИзмененииНаСервере()
	
	СпособФормированияСообщений = Объект.СпособФормированияСообщений;
	МассивСтраницСпособов = Новый Массив;
	МассивСтраницСпособов.Добавить("КонструкторСообщения");
	МассивСтраницСпособов.Добавить("ПроизвольныйАлгоритм");
	МассивСтраницСпособов.Добавить("ПравилоКонвертации");
	
	Для Каждого ИмяСтраницы Из МассивСтраницСпособов Цикл
		ВидимостьСтраницы = СпособФормированияСообщений = Перечисления.MultiPort_СпособыПреобразованияСообщений[ИмяСтраницы];
		Элементы["Страница" + ИмяСтраницы].Видимость = ВидимостьСтраницы;		
	КонецЦикла;	
	
КонецПроцедуры 

&НаКлиенте
Процедура ВариантПроизвольногоОбработчикаПриИзменении(Элемент)	
	ВариантПроизвольногоОбработчикаПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВариантПроизвольногоОбработчикаПриИзмененииНаСервере()
	
	ВариантПроизвольногоОбработчика = Объект.ВариантПроизвольногоОбработчика;
	
	Элементы.ИмяВстроенногоОбработчика.Видимость = Ложь;
	Элементы.ОбработкаФормированияИсходящего.Видимость = Ложь;
	Элементы.ГруппаКодФормирования.Видимость = Ложь;
	Элементы.ИнфоВариантОбработчикаИной.Видимость = Ложь;
	
	Если ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ВстроенныйОбработчик Тогда
		Элементы.ИмяВстроенногоОбработчика.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ПодключаемыйОбработчик Тогда
		Элементы.ОбработкаФормированияИсходящего.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ПроизвольныйКод Тогда
		Элементы.ГруппаКодФормирования.Видимость = Истина;
	ИначеЕсли ВариантПроизвольногоОбработчика = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ОпределяетсяВнеПодсистемы Тогда
		Элементы.ИнфоВариантОбработчикаИной.Видимость = Истина; 		
	Иначе
		Элементы.ИнфоВариантОбработчикаИной.Видимость = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбработчикаПриОтправкеПриИзменении(Элемент)
	ВариантОбработчикаПриОтправкеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВариантОбработчикаПриОтправкеПриИзмененииНаСервере()
	
	ВариантОбработчикаПриОтправке = Объект.ВариантОбработчикаПриОтправке;
	
	Элементы.ИмяВстроенногоОбработчикаПриОтправке.Видимость = Ложь;
	Элементы.ОбработкаПриОтправке.Видимость = Ложь;
	Элементы.ИнфоВариантОбработчикаПриОтправкеИной.Видимость = Ложь;
	Элементы.ИнфоПередОтправкой.Видимость = Истина;
	
	Если ВариантОбработчикаПриОтправке = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ВстроенныйОбработчик Тогда
		Элементы.ИмяВстроенногоОбработчикаПриОтправке.Видимость = Истина;
	ИначеЕсли ВариантОбработчикаПриОтправке = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ПодключаемыйОбработчик Тогда
		Элементы.ОбработкаПриОтправке.Видимость = Истина; 
	ИначеЕсли ВариантОбработчикаПриОтправке = 
		Перечисления.MultiPort_ВариантыПроизвольногоОбработчика.ОпределяетсяВнеПодсистемы Тогда
		Элементы.ИнфоВариантОбработчикаПриОтправкеИной.Видимость = Истина; 
		Элементы.ИнфоПередОтправкой.Видимость = Ложь;
	Иначе
		Элементы.ИнфоВариантОбработчикаПриОтправкеИной.Видимость = Истина;
		Элементы.ИнфоПередОтправкой.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОбработчикаПриОтправкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(
		ПредопределенноеЗначение("Перечисление.MultiPort_ВариантыПроизвольногоОбработчика.ВстроенныйОбработчик"),
		"Встроенный обработчик"); 
	СписокЗначений.Добавить(
		ПредопределенноеЗначение("Перечисление.MultiPort_ВариантыПроизвольногоОбработчика.ПодключаемыйОбработчик"),
		"Подключаемый обработчик"); 
	
	ДанныеВыбора = СписокЗначений;

КонецПроцедуры

&НаСервере
Процедура ВозвращатьОтветВИнтерфейсПриИзмененииНаСервере()
	
	Если Объект.ВозвращатьОтветВИнтерфейс Тогда
		Объект.ОбрабатыватьРезультатЗапроса = Ложь;
	КонецЕсли;                       
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвращатьОтветВИнтерфейсПриИзменении(Элемент)
	ВозвращатьОтветВИнтерфейсПриИзмененииНаСервере();
КонецПроцедуры
   
#КонецОбласти
